note/note-Mongo.org

#+SETUPFILE: setup.org
#+TITLE: mongo 使用笔记
* Mongo 使用笔记
** Mongo集群安装
** 常用命令
   1. 创建索引
   
     db.smrt.ensureIndex({"ip":1})
      
   2.聚合出字段种类

     db.smrt.distinct("tags")

     db.all_iocs.find({"malicious_family":{$size:3}})
   3. 
      db.ip_history_v1.find({"insert_time":{"$gte":1496357774,"$lte":1496357775}})
      db.ip_history_v1.find({"insert_time":{"$gte":1498037117,"$lte":1498037119}})
      db.ip_history_v1.find({"history":{"$elemMatch":{"source":"emergingthreats.net"}}})
      db.ip_history_v1.remove({"history":{"$elemMatch":{"attack_time":{'$gte':'2016-05-11T15:29:21','$lte':'2017-07-11T15:29:21'}}}})
      

      db.ip_history_v1.find({"history":{"$elemMatch":{"insertime":{"$gte":"1509840000","$lte":"1509926400"}}}})

      
