note/note-mongo.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>mongo 使用笔记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">mongo 使用笔记</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org65eb287">1. Mongo 使用笔记</a>
<ul>
<li><a href="#orge1aef8d">1.1. Mongo集群安装</a></li>
<li><a href="#org612cf0b">1.2. 常用命令</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org65eb287" class="outline-2">
<h2 id="org65eb287"><span class="section-number-2">1</span> Mongo 使用笔记</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge1aef8d" class="outline-3">
<h3 id="orge1aef8d"><span class="section-number-3">1.1</span> Mongo集群安装</h3>
</div>
<div id="outline-container-org612cf0b" class="outline-3">
<h3 id="org612cf0b"><span class="section-number-3">1.2</span> 常用命令</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li><p>
创建索引<br>
</p>

<p>
db.smrt.ensureIndex({"ip":1})<br>
</p></li>
</ol>

<p>
2.聚合出字段种类<br>
</p>

<p>
db.smrt.distinct("tags")<br>
</p>

<p>
db.all_iocs.find({"malicious_family":{$size:3}})<br>
</p>
<ol class="org-ol">
<li>db.ip_history_v1.find({"insert_time":{"$gte":1496357774,"$lte":1496357775}})<br>
db.ip_history_v1.find({"insert_time":{"$gte":1498037117,"$lte":1498037119}})<br>
db.ip_history_v1.find({"history":{"$elemMatch":{"source":"emergingthreats.net"}}})<br>
db.ip_history_v1.remove({"history":{"$elemMatch":{"attack_time":{'$gte':'2016-05-11T15:29:21','$lte':'2017-07-11T15:29:21'}}}})<br></li>
</ol>


<p>
db.ip_history_v1.find({"history":{"$elemMatch":{"insertime":{"$gte":"1509840000","$lte":"1509926400"}}}})<br>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>